# Density Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DuctPressureDropData..::..Density Property
DuctPressureDropData Class See Also
---
The density of the duct.Units: (kg/ft³).
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public double Density { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Density As Double
	Get
```

Visual C++
---
```text
public:
property double Density {
	double get ();
}
```

# See Also
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace